Masmiseim36/nxpSDK/boards/hvpkv11z75m/demo_apps/mc_bldc/pin_mux.h
/*
 * Copyright 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief FTM0 channel 0 output PWM/OCMP mode source select: FTM0CH0 pin is the output of FTM0 channel 0 PWM/OCMP */
#define SOPT8_FTM0OCH0SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM0 channel 1 output PWM/OCMP mode source select: FTM0CH1 pin is the output of FTM0 channel 1 PWM/OCMP */
#define SOPT8_FTM0OCH1SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM0 channel 2 output PWM/OCMP mode source select: FTM0CH2 pin is the output of FTM0 channel 2 PWM/OCMP */
#define SOPT8_FTM0OCH2SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM0 channel 3 output PWM/OCMP mode source select: FTM0CH3 pin is the output of FTM0 channel 3 PWM/OCMP */
#define SOPT8_FTM0OCH3SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM0 channel 4 output PWM/OCMP mode source select: FTM0CH4 pin is the output of FTM0 channel 4 PWM/OCMP */
#define SOPT8_FTM0OCH4SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM0 channel 5 output PWM/OCMP mode source select: FTM0CH5 pin is the output of FTM0 channel 5 PWM/OCMP */
#define SOPT8_FTM0OCH5SRC_NO_MODULATION 0x00u

/*! @name PORTE25 (number 16), FTM0_CH1
  @{ */

/* Symbols to be used with PORT driver */
#define PINTOOL_FTM_FTM0_CH1_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define PINTOOL_FTM_FTM0_CH1_PIN 25U                   /*!<@brief PORT pin number */
#define PINTOOL_FTM_FTM0_CH1_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTC4 (number 37), FTM0_CH3
  @{ */

/* Symbols to be used with PORT driver */
#define PINTOOL_FTM_FTM0_CH3_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define PINTOOL_FTM_FTM0_CH3_PIN 4U                   /*!<@brief PORT pin number */
#define PINTOOL_FTM_FTM0_CH3_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTC5 (number 38), FTM0_CH2
  @{ */

/* Symbols to be used with PORT driver */
#define PINTOOL_FTM_FTM0_CH2_PORT PORTC               /*!<@brief PORT peripheral base pointer */
#define PINTOOL_FTM_FTM0_CH2_PIN 5U                   /*!<@brief PORT pin number */
#define PINTOOL_FTM_FTM0_CH2_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTD4 (number 45), FTM0_CH4
  @{ */

/* Symbols to be used with PORT driver */
#define PINTOOL_FTM_FTM0_CH4_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define PINTOOL_FTM_FTM0_CH4_PIN 4U                   /*!<@brief PORT pin number */
#define PINTOOL_FTM_FTM0_CH4_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTD5 (number 46), FTM0_CH5
  @{ */

/* Symbols to be used with PORT driver */
#define PINTOOL_FTM_FTM0_CH5_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define PINTOOL_FTM_FTM0_CH5_PIN 5U                   /*!<@brief PORT pin number */
#define PINTOOL_FTM_FTM0_CH5_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PORTE24 (number 15), FTM0_CH0
  @{ */

/* Symbols to be used with PORT driver */
#define PINTOOL_FTM_FTM0_CH0_PORT PORTE                /*!<@brief PORT peripheral base pointer */
#define PINTOOL_FTM_FTM0_CH0_PIN 24U                   /*!<@brief PORT pin number */
#define PINTOOL_FTM_FTM0_CH0_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_FTM(void);

#define SOPT5_UART1RXSRC_UART_RX 0x00u /*!<@brief UART 1 Receive Data Source Select: UART1_RX pin */
#define SOPT5_UART1TXSRC_UART_TX 0x00u /*!<@brief UART 1 Transmit Data Source Select: UART1_TX pin */

/*! @name PORTD0 (number 41), UART1_RX
  @{ */

/* Symbols to be used with PORT driver */
#define PINTOOL_UART_UART1_RX_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define PINTOOL_UART_UART1_RX_PIN 0U                   /*!<@brief PORT pin number */
#define PINTOOL_UART_UART1_RX_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PORTD1 (number 42), UART1_TX
  @{ */

/* Symbols to be used with PORT driver */
#define PINTOOL_UART_UART1_TX_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define PINTOOL_UART_UART1_TX_PIN 1U                   /*!<@brief PORT pin number */
#define PINTOOL_UART_UART1_TX_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_UART(void);

/*! @name PORTA18 (number 24), Relay
  @{ */

/* Symbols to be used with GPIO driver */
#define PINTOOL_MISC_Relay_FGPIO FGPIOA              /*!<@brief FGPIO peripheral base pointer */
#define PINTOOL_MISC_Relay_GPIO GPIOA                /*!<@brief GPIO peripheral base pointer */
#define PINTOOL_MISC_Relay_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PINTOOL_MISC_Relay_PORT PORTA                /*!<@brief PORT peripheral base pointer */
#define PINTOOL_MISC_Relay_PIN 18U                   /*!<@brief PORT pin number */
#define PINTOOL_MISC_Relay_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                     /* @} */

/*! @name PORTD2 (number 43), USER_LED
  @{ */

/* Symbols to be used with GPIO driver */
#define PINTOOL_MISC_USER_LED_FGPIO FGPIOD             /*!<@brief FGPIO peripheral base pointer */
#define PINTOOL_MISC_USER_LED_GPIO GPIOD               /*!<@brief GPIO peripheral base pointer */
#define PINTOOL_MISC_USER_LED_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define PINTOOL_MISC_USER_LED_PORT PORTD               /*!<@brief PORT peripheral base pointer */
#define PINTOOL_MISC_USER_LED_PIN 2U                   /*!<@brief PORT pin number */
#define PINTOOL_MISC_USER_LED_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_Misc(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
